cf/InformationRegisters/ServiceUserDetails.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ServiceUserDetails</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>LastActivityDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>NotifyChanged</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ServiceUserID</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/InformationRegisters/ServiceUserDetails/Ext/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

Procedure AddRecord(CurrentUser, WriteParameters) Export
	
	SetPrivilegedMode(True);
	
	ServiceUserID = Common.ObjectAttributeValue(
		CurrentUser,
		"ServiceUserID");
	
	If Not ValueIsFilled(ServiceUserID) Then
		Return;
	EndIf;
	
	Block = New DataLock();
	LockItem = Block.Add("InformationRegister.ServiceUserDetails");
	LockItem.SetValue("ServiceUserID", ServiceUserID);
	
	BeginTransaction();
	
	Try
		
		Block.Lock();
		
		Write = False;
		
		RegisterRecord = CreateRecordManager();
		RegisterRecord.ServiceUserID = ServiceUserID;
		RegisterRecord.Read();
		
		If Not RegisterRecord.Selected() Then
			RegisterRecord.ServiceUserID = ServiceUserID;
			Write = True;
		Else
			
			For Each ParameterItem In WriteParameters Do
				
				If RegisterRecord[ParameterItem.Key] <> ParameterItem.Value Then
					Write = True;
					Break;
				EndIf;
				
			EndDo;
			
		EndIf;
		
		If Write Then
			
			FillPropertyValues(RegisterRecord, WriteParameters);
			RegisterRecord.NotifyChanged = True;
			RegisterRecord.Write();
			
		EndIf;
		
		CommitTransaction();
		
	Except
		
		RollbackTransaction();
		Raise;
		
	EndTry;
	
	SetPrivilegedMode(False);
	
EndProcedure

#EndRegion

#EndIf
